Autodesk.Revit.UI.RibbonPanel.AddStackedItems(Autodesk.Revit.UI.RibbonItemData,Autodesk.Revit.UI.RibbonItemData,Autodesk.Revit.UI.RibbonItemData)
Adds three stacked items to the panel.
item1:  Data containing information about the first item. This data must be of type PushButtonData, PulldownButtonData, ComboBoxData, or TextBoxData.
item2:  Data containing information about the second item. This data must be of type PushButtonData, PulldownButtonData, ComboBoxData, or TextBoxData.
item3:  Data containing information about the third item. This data must be of type PushButtonData, PulldownButtonData, ComboBoxData, or TextBoxData.
Returns:  A collection containing the added items.
Remarks:  Each new item may either be a PushButton, PulldownButton, ComboBox or TextBox, depending upon the type of
data passed in for each argument. The new items will be created as small-size horizontal controls,
with the first stacked on top of the second in the panel.
Throws Autodesk.Revit.Exceptions.ArgumentNullException: Thrown when item1, item2 or item3 is null.
Throws Autodesk.Revit.Exceptions.ArgumentException: Thrown when an item with item1.Name or item2.Name or item3.Name already exists in the panel or the data is not of the correct type.
Since: 2011

Autodesk.Revit.UI.RibbonPanel.AddStackedItems(Autodesk.Revit.UI.RibbonItemData,Autodesk.Revit.UI.RibbonItemData)
Adds two stacked items to the panel.
item1:  Data containing information about the first item. This data must be of type PushButtonData, PulldownButtonData, ComboBoxData, or TextBoxData.
item2:  Data containing information about the second item. This data must be of type PushButtonData, PulldownButtonData, ComboBoxData, or TextBoxData.
Returns:  A collection containing the added items.
Remarks:  Each new item may either be a PushButton, PulldownButton, ComboBox or TextBox, depending upon the type of
data passed in for each argument. The new items will be created as small-size horizontal controls,
with the first stacked on top of the second in the panel.
Throws Autodesk.Revit.Exceptions.ArgumentNullException: Thrown when item1 or item2 is null.
Throws Autodesk.Revit.Exceptions.ArgumentException: Thrown when an item with the item1.Name or item2.Name already exists in the panel or the data is not of the correct type.
Since: 2011